int [][] floor = {
  {3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 3},
  {3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 3},
  {3, 4, 4, 4, 4, 1, 1, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 3},
  {3, 4, 4, 4, 4, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 3},
  {3, 4, 4, 4, 4, 3, 5, 6, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 3},
  {3, 4, 4, 4, 4, 3, 3, 3, 7, 8, 9, 3, 3, 3, 3, 3, 4, 4, 4, 3},
  {3, 4, 4, 4, 4, 3, 3, 3, 3, 3, 10, 3, 3, 3, 3, 3, 4, 4, 4, 3},
  {3, 4, 4, 4, 4, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 3},
  {3, 4, 4, 4, 4, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 3},
  {3, 4, 4, 4, 4, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 3},
  {3, 4, 4, 4, 4, 3, 18, 19, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 3},
  {3, 4, 4, 4, 4, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 3},
  {3, 4, 4, 4, 4, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 3},
  {3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 3},
  {3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 3}
};
PImage img, user;
PImage [] fimg = new  PImage[40];
void setup(){
   size(640,480);//15格=480,480/15=32
   img = loadImage("640x480.png");
   user = loadImage("20.png");
   for(int i=1; i<=22; i++) fimg[i] = loadImage(i+".png");
}
int userI = 12, userJ = 15;
void draw(){
   background(img); 
   for(int i=0; i<floor.length; i++){//高
      for(int j=0; j<20; j++){//寬
         int now = floor[i][j];
         image(fimg[now],j*32, i*32);
      }
   }
   image(user, userJ*32, userI*32);
}
void keyPressed(){
   int newI = userI, newJ = userJ;
   if(keyCode==RIGHT) newJ++;
   if(keyCode==LEFT) newJ--;
   if(keyCode==UP) newI--;
   if(keyCode==DOWN) newI++;
   if(floor[newI][newJ]!=2 && floor[newI][newJ]!=4){
      userI = newI;
      userJ = newJ;
   }
}
